; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image0 - mode
	thermograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(calibration_target instrument1 Star5)
	(supports instrument2 image0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 image0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star5)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation4)
)
(:goal (and
	(pointing satellite2 Planet7)
	(have_image Phenomenon6 image0)
	(have_image Planet7 thermograph1)
	(have_image Planet8 image0)
	(have_image Star9 image0)
	(have_image Star10 thermograph1)
	(have_image Phenomenon11 image0)
	(have_image Planet12 thermograph1)
))

)

; plan
1. (turn_to satellite2 planet7 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet7)
   goals met: 1 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 8
3. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 1 of 8
4. (turn_to satellite1 planet12 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet12)
   goals met: 1 of 8
5. (take_image satellite1 planet12 instrument4 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 2 of 8
6. (turn_to satellite1 phenomenon6 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 8
7. (take_image satellite1 phenomenon6 instrument4 image0)
   added: (have_image phenomenon6 image0)
   goals met: 3 of 8
8. (turn_to satellite1 phenomenon11 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 8
9. (take_image satellite1 phenomenon11 instrument4 image0)
   added: (have_image phenomenon11 image0)
   goals met: 4 of 8
10. (turn_to satellite1 planet7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet7)
   goals met: 4 of 8
11. (take_image satellite1 planet7 instrument4 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 5 of 8
12. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 5 of 8
13. (take_image satellite1 planet8 instrument4 image0)
   added: (have_image planet8 image0)
   goals met: 6 of 8
14. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 6 of 8
15. (take_image satellite1 star10 instrument4 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 7 of 8
16. (turn_to satellite1 star9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star9)
   goals met: 7 of 8
17. (take_image satellite1 star9 instrument4 image0)
   added: (have_image star9 image0)
   goals met: 8 of 8
